# Development Tools
brew "cloc"
brew "dockutil"
brew "duti"
brwe "findutils"
brew "ffmpeg"
cask "git-credential-manager"
cask "ipatool"
brew "kin"
brew "mas"
cask "periphery"
brew "proctools"
brew "artginzburg/tap/sudo-touchid"
brew "swiftlint"
brew "swift-format"
brew "TomAnthony/brews/itermocil"
brew "unxip"
brew "xcbeautify"
brew "XCTestHtmlReport/xchtmlreport/xchtmlreport"
brew "xcode-build-server"
brew "xcodes"

# Python
brew "python"
brew "ruff"
brew "uv"
brew "llm"

brew "node"
brew "ruby"
brew "magic-wormhole"
brew "awscli"
