# Brewfile for Mac App Store applications
# This file is used to install applications from the Mac App Store using `mas`.
# It is intended to be used with Homebrew and the `mas` command-line tool.

# For all machines.
mas "1Blocker", id: 1365531024
mas "Apple Configurator 2", id: 1037126344
mas "Control Panel for Twitter", id: 1668516167
mas "Control Panel for YouTube", id: 6478456678
mas "Homecoming for Mastodon", id: 1666139593
mas "Ice Cubes for Mastodon", id: 6444915884
mas "Kagi for Safari", id: 1622835804
mas "Keka", id: 470158793
mas "PCalc", id: 403504866
mas "StopTheMadness Pro", id: 6471380298
mas "PDF Expert", id: 1055273043
mas "Pixeur - Screen Color Picker", id: 1507890049
mas "Transloader", id: 572281534
mas "Tailscale", id: 1475387142

# For all machines except homelab machines like the M1 Server.
{{ if not .homelab }}
mas "10ten Japanese Reader", id: 1573540634
mas "A Companion for SwiftUI", id: 1485436674
mas "Base - SQLite Editor", id: 6744867438
mas "CARROT Weather", id: 993487541
mas "Channels Pro - IPTV Player", id: 1552284117
mas "CodeRunner 4", id: 955297617
mas "Core Data Lab", id: 1460684638
mas "Craft", id: 1487937127
mas "Craft Web Clipper", id: 6748613311
mas "Darkroom: Photo & Video Editor", id: 953286746
mas "Day One", id: 1055511498
mas "DevCleaner", id: 1388020431
mas "Developer", id: 640199958
mas "Dropover Easier Drag Drop", id: 1355679052
mas "Easy CSV Editor", id: 1171346381
mas "Expressions", id: 913158085
mas "Home Assistant", id: 1099568401
mas "HomePass for HomeKit", id: 1330266650
mas "Infuse 7", id: 1136220934
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OmniOutliner", id: 1142578772
mas "Otter Log Console", id: 6479258228
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Parcel - Delivery Tracking", id: 639968404
mas "Photomator Photo Editor", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "Privacy for Safari", id: 6449850851
mas "Prompt 3", id: 1594420480
mas "Renamer 6", id: 1460229011
mas "RocketSim for Xcode Simulator", id: 1504940162
mas "Screens 5: VNC Remote Desktop", id: 1663047912
mas "Sketch Digital Design Toolkit", id: 1667260533
mas "Sleeve for Spotify Music", id: 1606145041
mas "Soulver 3", id: 1508732804
mas "Spokenly", id: 6740315592
mas "TableFlip", id: 1462643128
mas "Taska for GitHub Issues", id: 6741809383
mas "Testpiler", id: 6737156289
mas "xScope", id: 889428659
mas "Copilot Track Budget Money", id: 1447330651
{{ end }}
