brew "aria2"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "just"
brew "less"
brew "pbzip2"
brew "pigz"
brew "sqlite"
brew "tree"
brew "wget"
brew "zoxide"
brew "zsh"
brew "vim"
