# Taps
tap "homebrew/bundle"

brew "aria2"
brew "fzf"
brew "gh"
brew "git"
cask "git-credential-manager-core"
brew "git-lfs"
brew "jq"
brew "just"
brew "less"
brew "neovim"
brew "pbzip2"
brew "pigz"
brew "proctools"
brew "ripgrep"
brew "sqlite"
brew "tree"
brew "tmux"
brew "wget"
brew "zoxide"
brew "zsh"
brew "vim"
brew "1password-cli"
