brew "aria2"
brew "bat"
brew "chafa"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "htop"
brew "jq"
brew "just"
brew "less"
brew "pbzip2"
brew "pigz"
brew "ripgrep"
brew "sqlite"
brew "tree"
brew "tmux"
brew "tmuxinator"
brew "wget"
brew "zoxide"
brew "zsh"
brew "vim"
cask "1password-cli"
